{
	"name": "pipeline_LogAnalytics",
	"properties": {
		"activities": [
			{
				"name": "Azure Function to Get AzureActivity Log",
				"type": "AzureFunctionActivity",
				"dependsOn": [],
				"policy": {
					"timeout": "7.00:00:00",
					"retry": 0,
					"retryIntervalInSeconds": 30,
					"secureOutput": false,
					"secureInput": false
				},
				"userProperties": [],
				"typeProperties": {
					"functionName": {
						"value": "@pipeline().parameters.FunctionName",
						"type": "Expression"
					},
					"method": "POST",
					"headers": {
						"Content-Type": "application/json"
					},
					"body": {
						"value": "{\n    \"tenentId\" : \"@{pipeline().parameters.TenentId}\",\n    \"contentType\" : \"@{pipeline().parameters.ContentType}\",\n    \"grantType\" : \"@{pipeline().parameters.GrantType}\",\n    \"clientId\" : \"@{pipeline().parameters.ClientId}\",\n    \"clientSecret\" : \"@{pipeline().parameters.ClientSecret}\",\n    \"resource\" : \"@{pipeline().parameters.Resource}\",\n    \"endPointUrl\" : \"@{pipeline().parameters.EndPointUrl}\",\n    \"workSpaceId\" : \"@{pipeline().parameters.WorkSpaceId}\",\n    \"logAnalyticsUrl\" : \"@{pipeline().parameters.LogAnalyticsUrl}\",\n    \"logQuery\" : \"@{pipeline().parameters.LogQuery}\"\n}",
						"type": "Expression"
					}
				},
				"linkedServiceName": {
					"referenceName": "AzureFunction_LinkedService",
					"type": "LinkedServiceReference"
				}
			},
			{
				"name": "Azure Function to store LogData in ADL",
				"type": "AzureFunctionActivity",
				"dependsOn": [
					{
						"activity": "Azure Function to Get AzureActivity Log",
						"dependencyConditions": [
							"Succeeded"
						]
					}
				],
				"policy": {
					"timeout": "7.00:00:00",
					"retry": 0,
					"retryIntervalInSeconds": 30,
					"secureOutput": false,
					"secureInput": false
				},
				"userProperties": [],
				"typeProperties": {
					"functionName": {
						"value": "@pipeline().parameters.PreProcessFunctionName",
						"type": "Expression"
					},
					"method": "POST",
					"headers": {
						"Content-Type": "application/json"
					},
					"body": {
						"value": "{\n    \"jsonRequestData\" : {\n            \"tables\": [\n                {\n                    \"name\": \"PrimaryResult\",\n                    \"columns\": [\n                        {\n                            \"name\": \"OperationName\",\n                            \"type\": \"string\"\n                        },\n                        {\n                            \"name\": \"OperationNameValue\",\n                            \"type\": \"string\"\n                        },\n                        {\n                            \"name\": \"Level\",\n                            \"type\": \"string\"\n                        },\n                        {\n                            \"name\": \"ActivityStatus\",\n                            \"type\": \"string\"\n                        },\n                        {\n                            \"name\": \"ActivityStatusValue\",\n                            \"type\": \"string\"\n                        },\n                        {\n                            \"name\": \"ActivitySubstatus\",\n                            \"type\": \"string\"\n                        },\n                        {\n                            \"name\": \"ActivitySubstatusValue\",\n                            \"type\": \"string\"\n                        },\n                        {\n                            \"name\": \"ResourceGroup\",\n                            \"type\": \"string\"\n                        },\n                        {\n                            \"name\": \"SubscriptionId\",\n                            \"type\": \"string\"\n                        },\n                        {\n                            \"name\": \"CorrelationId\",\n                            \"type\": \"string\"\n                        },\n                        {\n                            \"name\": \"Caller\",\n                            \"type\": \"string\"\n                        },\n                        {\n                            \"name\": \"CallerIpAddress\",\n                            \"type\": \"string\"\n                        },\n                        {\n                            \"name\": \"Category\",\n                            \"type\": \"string\"\n                        },\n                        {\n                            \"name\": \"CategoryValue\",\n                            \"type\": \"string\"\n                        },\n                        {\n                            \"name\": \"HTTPRequest\",\n                            \"type\": \"string\"\n                        },\n                        {\n                            \"name\": \"Properties\",\n                            \"type\": \"string\"\n                        },\n                        {\n                            \"name\": \"EventSubmissionTimestamp\",\n                            \"type\": \"datetime\"\n                        },\n                        {\n                            \"name\": \"Authorization\",\n                            \"type\": \"string\"\n                        },\n                        {\n                            \"name\": \"ResourceId\",\n                            \"type\": \"string\"\n                        },\n                        {\n                            \"name\": \"OperationId\",\n                            \"type\": \"string\"\n                        },\n                        {\n                            \"name\": \"ResourceProvider\",\n                            \"type\": \"string\"\n                        },\n                        {\n                            \"name\": \"ResourceProviderValue\",\n                            \"type\": \"string\"\n                        },\n                        {\n                            \"name\": \"Resource\",\n                            \"type\": \"string\"\n                        },\n                        {\n                            \"name\": \"EventDataId\",\n                            \"type\": \"string\"\n                        },\n                        {\n                            \"name\": \"TenantId\",\n                            \"type\": \"string\"\n                        },\n                        {\n                            \"name\": \"TimeGenerated\",\n                            \"type\": \"datetime\"\n                        },\n                        {\n                            \"name\": \"SourceSystem\",\n                            \"type\": \"string\"\n                        },\n                        {\n                            \"name\": \"Authorization_d\",\n                            \"type\": \"dynamic\"\n                        },\n                        {\n                            \"name\": \"Claims\",\n                            \"type\": \"string\"\n                        },\n                        {\n                            \"name\": \"Claims_d\",\n                            \"type\": \"dynamic\"\n                        },\n                        {\n                            \"name\": \"Properties_d\",\n                            \"type\": \"dynamic\"\n                        },\n                        {\n                            \"name\": \"Hierarchy\",\n                            \"type\": \"string\"\n                        },\n                        {\n                            \"name\": \"Type\",\n                            \"type\": \"string\"\n                        },\n                        {\n                            \"name\": \"_ResourceId\",\n                            \"type\": \"string\"\n                        }\n                    ],\n                    \"rows\": [\n                        [\n                            \"List Storage Account Keys\",\n                            \"Microsoft.Storage/storageAccounts/listKeys/action\",\n                            \"Informational\",\n                            \"Succeeded\",\n                            \"Succeeded\",\n                            \"OK (HTTP Status Code: 200)\",\n                            \"OK\",\n                            \"azure-data-factory-demo\",\n                            \"2f74b086-1adb-4bdf-ab0d-c693816302a7\",\n                            \"02e55f9f-27ee-4d0d-8479-1117c7d67946\",\n                            \"agamoni.demo@gmail.com\",\n                            \"103.217.243.70\",\n                            \"Administrative\",\n                            \"Administrative\",\n                            \"{\\r\\n  \\\"clientRequestId\\\": \\\"b2869d91-0f1a-4e71-885a-abc9b61a5004\\\",\\r\\n  \\\"clientIpAddress\\\": \\\"103.217.243.70\\\",\\r\\n  \\\"method\\\": \\\"POST\\\"\\r\\n}\",\n                            \"{\\r\\n  \\\"statusCode\\\": \\\"OK\\\",\\r\\n  \\\"serviceRequestId\\\": \\\"c220c99a-ea80-455f-a1ae-b6f6673bb67b\\\",\\r\\n  \\\"eventCategory\\\": \\\"Administrative\\\",\\r\\n  \\\"entity\\\": \\\"/subscriptions/2f74b086-1adb-4bdf-ab0d-c693816302a7/resourceGroups/azure-data-factory-demo/providers/Microsoft.Storage/storageAccounts/123datalakegen2\\\",\\r\\n  \\\"message\\\": \\\"Microsoft.Storage/storageAccounts/listKeys/action\\\",\\r\\n  \\\"hierarchy\\\": \\\"\\\"\\r\\n}\",\n                            \"2020-11-09T14:24:49.182Z\",\n                            \"{\\r\\n  \\\"action\\\": \\\"Microsoft.Storage/storageAccounts/listKeys/action\\\",\\r\\n  \\\"scope\\\": \\\"/subscriptions/2f74b086-1adb-4bdf-ab0d-c693816302a7/resourceGroups/azure-data-factory-demo/providers/Microsoft.Storage/storageAccounts/123datalakegen2\\\"\\r\\n}\",\n                            \"/subscriptions/2f74b086-1adb-4bdf-ab0d-c693816302a7/resourceGroups/azure-data-factory-demo/providers/Microsoft.Storage/storageAccounts/123datalakegen2\",\n                            \"dd618adc-674b-4360-926c-1af079d4b1b6\",\n                            \"Microsoft.Storage\",\n                            \"Microsoft.Storage\",\n                            \"123datalakegen2\",\n                            \"81e2d0e5-0acc-429b-89e3-e2eb5479f806\",\n                            \"2f5d639a-25b6-44ac-8ee8-ec9f68fa95b5\",\n                            \"2020-11-09T14:23:14.867Z\",\n                            \"Azure\",\n                            null,\n                            \"\",\n                            null,\n                            null,\n                            \"\",\n                            \"AzureActivity\",\n                            \"/subscriptions/2f74b086-1adb-4bdf-ab0d-c693816302a7/resourcegroups/azure-data-factory-demo/providers/microsoft.storage/storageaccounts/123datalakegen2\"\n                        ],\n                        [\n                            \"Delete blob container\",\n                            \"Microsoft.Storage/storageAccounts/blobServices/containers/delete\",\n                            \"Informational\",\n                            \"Succeeded\",\n                            \"Succeeded\",\n                            \"OK (HTTP Status Code: 200)\",\n                            \"OK\",\n                            \"azure-data-factory-demo\",\n                            \"2f74b086-1adb-4bdf-ab0d-c693816302a7\",\n                            \"286f32bf-f8f4-4b4b-8eb9-89cdc0e8c5db\",\n                            \"agamoni.demo@gmail.com\",\n                            \"103.217.243.70\",\n                            \"Administrative\",\n                            \"Administrative\",\n                            \"{\\r\\n  \\\"clientRequestId\\\": \\\"b2869d91-0f1a-4e71-885a-abc9b61a500a\\\",\\r\\n  \\\"clientIpAddress\\\": \\\"103.217.243.70\\\",\\r\\n  \\\"method\\\": \\\"DELETE\\\"\\r\\n}\",\n                            \"{\\r\\n  \\\"statusCode\\\": \\\"OK\\\",\\r\\n  \\\"serviceRequestId\\\": \\\"6dc7500f-ae5a-41d5-934b-39185a3a9baa\\\",\\r\\n  \\\"eventCategory\\\": \\\"Administrative\\\",\\r\\n  \\\"entity\\\": \\\"/subscriptions/2f74b086-1adb-4bdf-ab0d-c693816302a7/resourceGroups/azure-data-factory-demo/providers/Microsoft.Storage/storageAccounts/123datalakegen2/blobServices/default/containers/azureactivity\\\",\\r\\n  \\\"message\\\": \\\"Microsoft.Storage/storageAccounts/blobServices/containers/delete\\\",\\r\\n  \\\"hierarchy\\\": \\\"\\\"\\r\\n}\",\n                            \"2020-11-09T14:42:18.167Z\",\n                            \"{\\r\\n  \\\"action\\\": \\\"Microsoft.Storage/storageAccounts/blobServices/containers/delete\\\",\\r\\n  \\\"scope\\\": \\\"/subscriptions/2f74b086-1adb-4bdf-ab0d-c693816302a7/resourceGroups/azure-data-factory-demo/providers/Microsoft.Storage/storageAccounts/123datalakegen2/blobServices/default/containers/azureactivity\\\"\\r\\n}\",\n                            \"/subscriptions/2f74b086-1adb-4bdf-ab0d-c693816302a7/resourceGroups/azure-data-factory-demo/providers/Microsoft.Storage/storageAccounts/123datalakegen2/blobServices/default/containers/azureactivity\",\n                            \"286f32bf-f8f4-4b4b-8eb9-89cdc0e8c5db\",\n                            \"Microsoft.Storage\",\n                            \"Microsoft.Storage\",\n                            \"azureactivity\",\n                            \"6ad0b293-85f2-4f76-889e-5cca2477eeea\",\n                            \"2f5d639a-25b6-44ac-8ee8-ec9f68fa95b5\",\n                            \"2020-11-09T14:40:28.384Z\",\n                            \"Azure\",\n                            null,\n                            \"\",\n                            null,\n                            null,\n                            \"\",\n                            \"AzureActivity\",\n                            \"/subscriptions/2f74b086-1adb-4bdf-ab0d-c693816302a7/resourcegroups/azure-data-factory-demo/providers/microsoft.storage/storageaccounts/123datalakegen2/blobservices/default/containers/azureactivity\"\n                        ],\n                        [\n                            \"List Web Apps Functions Keys\",\n                            \"Microsoft.Web/sites/functions/listkeys/action\",\n                            \"Informational\",\n                            \"Succeeded\",\n                            \"Succeeded\",\n                            \"OK (HTTP Status Code: 200)\",\n                            \"OK\",\n                            \"azure-data-factory-demo\",\n                            \"2f74b086-1adb-4bdf-ab0d-c693816302a7\",\n                            \"c70bbb9d-2a86-47dc-b7fc-87bfd1f8110e\",\n                            \"agamoni.demo@gmail.com\",\n                            \"103.217.243.70\",\n                            \"Administrative\",\n                            \"Administrative\",\n                            \"{\\r\\n  \\\"clientRequestId\\\": \\\"0dd1baf4-928b-4c48-850c-f9ad4ae0c4be\\\",\\r\\n  \\\"clientIpAddress\\\": \\\"103.217.243.70\\\",\\r\\n  \\\"method\\\": \\\"POST\\\"\\r\\n}\",\n                            \"{\\r\\n  \\\"statusCode\\\": \\\"OK\\\",\\r\\n  \\\"serviceRequestId\\\": \\\"df849973-df85-42ed-90c6-8ae657137127\\\",\\r\\n  \\\"eventCategory\\\": \\\"Administrative\\\",\\r\\n  \\\"entity\\\": \\\"/subscriptions/2f74b086-1adb-4bdf-ab0d-c693816302a7/resourceGroups/azure-data-factory-demo/providers/Microsoft.Web/sites/azurelogAnalyticsFunction/functions/accees-to-logAnalytics\\\",\\r\\n  \\\"message\\\": \\\"Microsoft.Web/sites/functions/listkeys/action\\\",\\r\\n  \\\"hierarchy\\\": \\\"\\\"\\r\\n}\",\n                            \"2020-11-09T14:42:08.208Z\",\n                            \"{\\r\\n  \\\"action\\\": \\\"Microsoft.Web/sites/functions/listkeys/action\\\",\\r\\n  \\\"scope\\\": \\\"/subscriptions/2f74b086-1adb-4bdf-ab0d-c693816302a7/resourceGroups/azure-data-factory-demo/providers/Microsoft.Web/sites/azurelogAnalyticsFunction/functions/accees-to-logAnalytics\\\"\\r\\n}\",\n                            \"/subscriptions/2f74b086-1adb-4bdf-ab0d-c693816302a7/resourceGroups/azure-data-factory-demo/providers/Microsoft.Web/sites/azurelogAnalyticsFunction/functions/accees-to-logAnalytics\",\n                            \"93c6fed6-1100-4847-bb5e-13419066d1a9\",\n                            \"Azure Web Sites\",\n                            \"Microsoft.Web\",\n                            \"accees-to-logAnalytics\",\n                            \"5116f62d-396f-48d2-b185-368999a49e00\",\n                            \"2f5d639a-25b6-44ac-8ee8-ec9f68fa95b5\",\n                            \"2020-11-09T14:40:29.695Z\",\n                            \"Azure\",\n                            null,\n                            \"\",\n                            null,\n                            null,\n                            \"\",\n                            \"AzureActivity\",\n                            \"/subscriptions/2f74b086-1adb-4bdf-ab0d-c693816302a7/resourcegroups/azure-data-factory-demo/providers/microsoft.web/sites/azureloganalyticsfunction/functions/accees-to-loganalytics\"\n                        ],\n                        [\n                            \"List Web Apps Functions Host Keys\",\n                            \"Microsoft.Web/sites/host/listkeys/action\",\n                            \"Informational\",\n                            \"Succeeded\",\n                            \"Succeeded\",\n                            \"OK (HTTP Status Code: 200)\",\n                            \"OK\",\n                            \"azure-data-factory-demo\",\n                            \"2f74b086-1adb-4bdf-ab0d-c693816302a7\",\n                            \"c70bbb9d-2a86-47dc-b7fc-87bfd1f8110e\",\n                            \"agamoni.demo@gmail.com\",\n                            \"103.217.243.70\",\n                            \"Administrative\",\n                            \"Administrative\",\n                            \"{\\r\\n  \\\"clientRequestId\\\": \\\"0dd1baf4-928b-4c48-850c-f9ad4ae0c4be\\\",\\r\\n  \\\"clientIpAddress\\\": \\\"103.217.243.70\\\",\\r\\n  \\\"method\\\": \\\"POST\\\"\\r\\n}\",\n                            \"{\\r\\n  \\\"statusCode\\\": \\\"OK\\\",\\r\\n  \\\"serviceRequestId\\\": \\\"11df336d-87ef-4a75-ad2a-8ab6cda97db6\\\",\\r\\n  \\\"eventCategory\\\": \\\"Administrative\\\",\\r\\n  \\\"entity\\\": \\\"/subscriptions/2f74b086-1adb-4bdf-ab0d-c693816302a7/resourceGroups/azure-data-factory-demo/providers/Microsoft.Web/sites/azurelogAnalyticsFunction/host/default\\\",\\r\\n  \\\"message\\\": \\\"Microsoft.Web/sites/host/listkeys/action\\\",\\r\\n  \\\"hierarchy\\\": \\\"\\\"\\r\\n}\",\n                            \"2020-11-09T14:42:18.168Z\",\n                            \"{\\r\\n  \\\"action\\\": \\\"Microsoft.Web/sites/host/listkeys/action\\\",\\r\\n  \\\"scope\\\": \\\"/subscriptions/2f74b086-1adb-4bdf-ab0d-c693816302a7/resourceGroups/azure-data-factory-demo/providers/Microsoft.Web/sites/azurelogAnalyticsFunction/host/default\\\"\\r\\n}\",\n                            \"/subscriptions/2f74b086-1adb-4bdf-ab0d-c693816302a7/resourceGroups/azure-data-factory-demo/providers/Microsoft.Web/sites/azurelogAnalyticsFunction/host/default\",\n                            \"e1be5599-4441-4fee-8731-516cab9c6d90\",\n                            \"Azure Web Sites\",\n                            \"Microsoft.Web\",\n                            \"default\",\n                            \"0caf2d4b-cc5d-495e-a3c1-d4a1a3f82253\",\n                            \"2f5d639a-25b6-44ac-8ee8-ec9f68fa95b5\",\n                            \"2020-11-09T14:40:30.164Z\",\n                            \"Azure\",\n                            null,\n                            \"\",\n                            null,\n                            null,\n                            \"\",\n                            \"AzureActivity\",\n                            \"/subscriptions/2f74b086-1adb-4bdf-ab0d-c693816302a7/resourcegroups/azure-data-factory-demo/providers/microsoft.web/sites/azureloganalyticsfunction/host/default\"\n                        ],\n                        [\n                            \"List Web Apps Functions Keys\",\n                            \"Microsoft.Web/sites/functions/listkeys/action\",\n                            \"Informational\",\n                            \"Succeeded\",\n                            \"Succeeded\",\n                            \"OK (HTTP Status Code: 200)\",\n                            \"OK\",\n                            \"azure-data-factory-demo\",\n                            \"2f74b086-1adb-4bdf-ab0d-c693816302a7\",\n                            \"303d3624-09a8-467c-bba2-918926f45c30\",\n                            \"agamoni.demo@gmail.com\",\n                            \"103.217.243.70\",\n                            \"Administrative\",\n                            \"Administrative\",\n                            \"{\\r\\n  \\\"clientRequestId\\\": \\\"f4e66d14-6844-4050-b95a-ac9c20e9901a\\\",\\r\\n  \\\"clientIpAddress\\\": \\\"103.217.243.70\\\",\\r\\n  \\\"method\\\": \\\"POST\\\"\\r\\n}\",\n                            \"{\\r\\n  \\\"statusCode\\\": \\\"OK\\\",\\r\\n  \\\"serviceRequestId\\\": \\\"1a3a7628-34c7-45b3-b0a4-47845be5a36b\\\",\\r\\n  \\\"eventCategory\\\": \\\"Administrative\\\",\\r\\n  \\\"entity\\\": \\\"/subscriptions/2f74b086-1adb-4bdf-ab0d-c693816302a7/resourceGroups/azure-data-factory-demo/providers/Microsoft.Web/sites/azurelogAnalyticsFunction/functions/convert-json-to-csv\\\",\\r\\n  \\\"message\\\": \\\"Microsoft.Web/sites/functions/listkeys/action\\\",\\r\\n  \\\"hierarchy\\\": \\\"\\\"\\r\\n}\",\n                            \"2020-11-09T15:03:05.175Z\",\n                            \"{\\r\\n  \\\"action\\\": \\\"Microsoft.Web/sites/functions/listkeys/action\\\",\\r\\n  \\\"scope\\\": \\\"/subscriptions/2f74b086-1adb-4bdf-ab0d-c693816302a7/resourceGroups/azure-data-factory-demo/providers/Microsoft.Web/sites/azurelogAnalyticsFunction/functions/convert-json-to-csv\\\"\\r\\n}\",\n                            \"/subscriptions/2f74b086-1adb-4bdf-ab0d-c693816302a7/resourceGroups/azure-data-factory-demo/providers/Microsoft.Web/sites/azurelogAnalyticsFunction/functions/convert-json-to-csv\",\n                            \"b1248b36-ff60-4ed2-bf66-58b14ae8f742\",\n                            \"Azure Web Sites\",\n                            \"Microsoft.Web\",\n                            \"convert-json-to-csv\",\n                            \"6dbdb95b-5911-4cc1-af3f-379d5d6e038a\",\n                            \"2f5d639a-25b6-44ac-8ee8-ec9f68fa95b5\",\n                            \"2020-11-09T15:01:14.525Z\",\n                            \"Azure\",\n                            null,\n                            \"\",\n                            null,\n                            null,\n                            \"\",\n                            \"AzureActivity\",\n                            \"/subscriptions/2f74b086-1adb-4bdf-ab0d-c693816302a7/resourcegroups/azure-data-factory-demo/providers/microsoft.web/sites/azureloganalyticsfunction/functions/convert-json-to-csv\"\n                        ],\n                        [\n                            \"List Web Apps Functions Host Keys\",\n                            \"Microsoft.Web/sites/host/listkeys/action\",\n                            \"Informational\",\n                            \"Succeeded\",\n                            \"Succeeded\",\n                            \"OK (HTTP Status Code: 200)\",\n                            \"OK\",\n                            \"azure-data-factory-demo\",\n                            \"2f74b086-1adb-4bdf-ab0d-c693816302a7\",\n                            \"303d3624-09a8-467c-bba2-918926f45c30\",\n                            \"agamoni.demo@gmail.com\",\n                            \"103.217.243.70\",\n                            \"Administrative\",\n                            \"Administrative\",\n                            \"{\\r\\n  \\\"clientRequestId\\\": \\\"f4e66d14-6844-4050-b95a-ac9c20e9901a\\\",\\r\\n  \\\"clientIpAddress\\\": \\\"103.217.243.70\\\",\\r\\n  \\\"method\\\": \\\"POST\\\"\\r\\n}\",\n                            \"{\\r\\n  \\\"statusCode\\\": \\\"OK\\\",\\r\\n  \\\"serviceRequestId\\\": \\\"606a03c5-8abe-484f-aff2-7dbf9e28b7d7\\\",\\r\\n  \\\"eventCategory\\\": \\\"Administrative\\\",\\r\\n  \\\"entity\\\": \\\"/subscriptions/2f74b086-1adb-4bdf-ab0d-c693816302a7/resourceGroups/azure-data-factory-demo/providers/Microsoft.Web/sites/azurelogAnalyticsFunction/host/default\\\",\\r\\n  \\\"message\\\": \\\"Microsoft.Web/sites/host/listkeys/action\\\",\\r\\n  \\\"hierarchy\\\": \\\"\\\"\\r\\n}\",\n                            \"2020-11-09T15:03:05.153Z\",\n                            \"{\\r\\n  \\\"action\\\": \\\"Microsoft.Web/sites/host/listkeys/action\\\",\\r\\n  \\\"scope\\\": \\\"/subscriptions/2f74b086-1adb-4bdf-ab0d-c693816302a7/resourceGroups/azure-data-factory-demo/providers/Microsoft.Web/sites/azurelogAnalyticsFunction/host/default\\\"\\r\\n}\",\n                            \"/subscriptions/2f74b086-1adb-4bdf-ab0d-c693816302a7/resourceGroups/azure-data-factory-demo/providers/Microsoft.Web/sites/azurelogAnalyticsFunction/host/default\",\n                            \"4e9412c1-6bb3-4e88-b891-f54f7ca210e0\",\n                            \"Azure Web Sites\",\n                            \"Microsoft.Web\",\n                            \"default\",\n                            \"b33086d1-e8e3-4fd9-9033-0d086388c0ba\",\n                            \"2f5d639a-25b6-44ac-8ee8-ec9f68fa95b5\",\n                            \"2020-11-09T15:01:14.941Z\",\n                            \"Azure\",\n                            null,\n                            \"\",\n                            null,\n                            null,\n                            \"\",\n                            \"AzureActivity\",\n                            \"/subscriptions/2f74b086-1adb-4bdf-ab0d-c693816302a7/resourcegroups/azure-data-factory-demo/providers/microsoft.web/sites/azureloganalyticsfunction/host/default\"\n                        ],\n                        [\n                            \"List Web Apps Functions Keys\",\n                            \"Microsoft.Web/sites/functions/listkeys/action\",\n                            \"Informational\",\n                            \"Succeeded\",\n                            \"Succeeded\",\n                            \"OK (HTTP Status Code: 200)\",\n                            \"OK\",\n                            \"azure-data-factory-demo\",\n                            \"2f74b086-1adb-4bdf-ab0d-c693816302a7\",\n                            \"583c9a56-9529-426d-a7b6-b0c65cbd7cbe\",\n                            \"agamoni.demo@gmail.com\",\n                            \"103.217.243.70\",\n                            \"Administrative\",\n                            \"Administrative\",\n                            \"{\\r\\n  \\\"clientRequestId\\\": \\\"60a9e566-447e-4556-b370-96618a5e27c6\\\",\\r\\n  \\\"clientIpAddress\\\": \\\"103.217.243.70\\\",\\r\\n  \\\"method\\\": \\\"POST\\\"\\r\\n}\",\n                            \"{\\r\\n  \\\"statusCode\\\": \\\"OK\\\",\\r\\n  \\\"serviceRequestId\\\": \\\"953dfc47-aba3-462c-87fe-69c1e2f95188\\\",\\r\\n  \\\"eventCategory\\\": \\\"Administrative\\\",\\r\\n  \\\"entity\\\": \\\"/subscriptions/2f74b086-1adb-4bdf-ab0d-c693816302a7/resourceGroups/azure-data-factory-demo/providers/Microsoft.Web/sites/azurelogAnalyticsFunction/functions/convert-json-to-csv\\\",\\r\\n  \\\"message\\\": \\\"Microsoft.Web/sites/functions/listkeys/action\\\",\\r\\n  \\\"hierarchy\\\": \\\"\\\"\\r\\n}\",\n                            \"2020-11-09T15:02:20.197Z\",\n                            \"{\\r\\n  \\\"action\\\": \\\"Microsoft.Web/sites/functions/listkeys/action\\\",\\r\\n  \\\"scope\\\": \\\"/subscriptions/2f74b086-1adb-4bdf-ab0d-c693816302a7/resourceGroups/azure-data-factory-demo/providers/Microsoft.Web/sites/azurelogAnalyticsFunction/functions/convert-json-to-csv\\\"\\r\\n}\",\n                            \"/subscriptions/2f74b086-1adb-4bdf-ab0d-c693816302a7/resourceGroups/azure-data-factory-demo/providers/Microsoft.Web/sites/azurelogAnalyticsFunction/functions/convert-json-to-csv\",\n                            \"15d4f69a-af6c-4d5f-a12e-347e76757fdf\",\n                            \"Azure Web Sites\",\n                            \"Microsoft.Web\",\n                            \"convert-json-to-csv\",\n                            \"2e9b9ddc-9871-4f52-b6fc-08622c8da5a7\",\n                            \"2f5d639a-25b6-44ac-8ee8-ec9f68fa95b5\",\n                            \"2020-11-09T15:01:20.844Z\",\n                            \"Azure\",\n                            null,\n                            \"\",\n                            null,\n                            null,\n                            \"\",\n                            \"AzureActivity\",\n                            \"/subscriptions/2f74b086-1adb-4bdf-ab0d-c693816302a7/resourcegroups/azure-data-factory-demo/providers/microsoft.web/sites/azureloganalyticsfunction/functions/convert-json-to-csv\"\n                        ],\n                        [\n                            \"Create or Update any Linked Service.\",\n                            \"Microsoft.DataFactory/factories/linkedServices/write\",\n                            \"Informational\",\n                            \"Succeeded\",\n                            \"Succeeded\",\n                            \"OK (HTTP Status Code: 200)\",\n                            \"OK\",\n                            \"azure-data-factory-demo\",\n                            \"2f74b086-1adb-4bdf-ab0d-c693816302a7\",\n                            \"a7395341-cd74-408d-b146-8526c4d76d87\",\n                            \"agamoni.demo@gmail.com\",\n                            \"103.217.243.70\",\n                            \"Administrative\",\n                            \"Administrative\",\n                            \"{\\r\\n  \\\"clientRequestId\\\": \\\"\\\",\\r\\n  \\\"clientIpAddress\\\": \\\"103.217.243.70\\\",\\r\\n  \\\"method\\\": \\\"PUT\\\"\\r\\n}\",\n                            \"{\\r\\n  \\\"statusCode\\\": \\\"OK\\\",\\r\\n  \\\"serviceRequestId\\\": null,\\r\\n  \\\"eventCategory\\\": \\\"Administrative\\\",\\r\\n  \\\"entity\\\": \\\"/subscriptions/2f74b086-1adb-4bdf-ab0d-c693816302a7/resourcegroups/azure-data-factory-demo/providers/Microsoft.DataFactory/factories/pipelineSetupV1/linkedServices/AzureFunction_CovertJsonToCsv_LinkedService\\\",\\r\\n  \\\"message\\\": \\\"Microsoft.DataFactory/factories/linkedServices/write\\\",\\r\\n  \\\"hierarchy\\\": \\\"\\\"\\r\\n}\",\n                            \"2020-11-09T15:03:53.18Z\",\n                            \"{\\r\\n  \\\"action\\\": \\\"Microsoft.DataFactory/factories/linkedServices/write\\\",\\r\\n  \\\"scope\\\": \\\"/subscriptions/2f74b086-1adb-4bdf-ab0d-c693816302a7/resourcegroups/azure-data-factory-demo/providers/Microsoft.DataFactory/factories/pipelineSetupV1/linkedServices/AzureFunction_CovertJsonToCsv_LinkedService\\\"\\r\\n}\",\n                            \"/subscriptions/2f74b086-1adb-4bdf-ab0d-c693816302a7/resourcegroups/azure-data-factory-demo/providers/Microsoft.DataFactory/factories/pipelineSetupV1/linkedServices/AzureFunction_CovertJsonToCsv_LinkedService\",\n                            \"a7395341-cd74-408d-b146-8526c4d76d87\",\n                            \"Microsoft.DataFactory\",\n                            \"Microsoft.DataFactory\",\n                            \"AzureFunction_CovertJsonToCsv_LinkedService\",\n                            \"b03df736-9ac6-4d0f-804e-4749d771d460\",\n                            \"2f5d639a-25b6-44ac-8ee8-ec9f68fa95b5\",\n                            \"2020-11-09T15:02:17.541Z\",\n                            \"Azure\",\n                            null,\n                            \"\",\n                            null,\n                            null,\n                            \"\",\n                            \"AzureActivity\",\n                            \"/subscriptions/2f74b086-1adb-4bdf-ab0d-c693816302a7/resourcegroups/azure-data-factory-demo/providers/microsoft.datafactory/factories/pipelinesetupv1/linkedservices/azurefunction_covertjsontocsv_linkedservice\"\n                        ],\n                        [\n                            \"Get exposure control feature values for a list of features\",\n                            \"Microsoft.DataFactory/factories/queryFeaturesValue/action\",\n                            \"Informational\",\n                            \"Succeeded\",\n                            \"Succeeded\",\n                            \"OK (HTTP Status Code: 200)\",\n                            \"OK\",\n                            \"azure-data-factory-demo\",\n                            \"2f74b086-1adb-4bdf-ab0d-c693816302a7\",\n                            \"766475c5-1012-44a9-bfaf-036fa7e95a03\",\n                            \"agamoni.demo@gmail.com\",\n                            \"103.217.243.70\",\n                            \"Administrative\",\n                            \"Administrative\",\n                            \"{\\r\\n  \\\"clientRequestId\\\": \\\"\\\",\\r\\n  \\\"clientIpAddress\\\": \\\"103.217.243.70\\\",\\r\\n  \\\"method\\\": \\\"POST\\\"\\r\\n}\",\n                            \"{\\r\\n  \\\"statusCode\\\": \\\"OK\\\",\\r\\n  \\\"serviceRequestId\\\": null,\\r\\n  \\\"eventCategory\\\": \\\"Administrative\\\",\\r\\n  \\\"entity\\\": \\\"/subscriptions/2f74b086-1adb-4bdf-ab0d-c693816302a7/resourcegroups/azure-data-factory-demo/providers/Microsoft.DataFactory/factories/pipelineSetupV1\\\",\\r\\n  \\\"message\\\": \\\"Microsoft.DataFactory/factories/queryFeaturesValue/action\\\",\\r\\n  \\\"hierarchy\\\": \\\"\\\"\\r\\n}\",\n                            \"2020-11-09T15:12:05.22Z\",\n                            \"{\\r\\n  \\\"action\\\": \\\"Microsoft.DataFactory/factories/queryFeaturesValue/action\\\",\\r\\n  \\\"scope\\\": \\\"/subscriptions/2f74b086-1adb-4bdf-ab0d-c693816302a7/resourcegroups/azure-data-factory-demo/providers/Microsoft.DataFactory/factories/pipelineSetupV1\\\"\\r\\n}\",\n                            \"/subscriptions/2f74b086-1adb-4bdf-ab0d-c693816302a7/resourcegroups/azure-data-factory-demo/providers/Microsoft.DataFactory/factories/pipelineSetupV1\",\n                            \"766475c5-1012-44a9-bfaf-036fa7e95a03\",\n                            \"Microsoft.DataFactory\",\n                            \"Microsoft.DataFactory\",\n                            \"pipelineSetupV1\",\n                            \"8b70fe99-f0bc-4402-b61a-e9cb153768ef\",\n                            \"2f5d639a-25b6-44ac-8ee8-ec9f68fa95b5\",\n                            \"2020-11-09T15:10:05.491Z\",\n                            \"Azure\",\n                            null,\n                            \"\",\n                            null,\n                            null,\n                            \"\",\n                            \"AzureActivity\",\n                            \"/subscriptions/2f74b086-1adb-4bdf-ab0d-c693816302a7/resourcegroups/azure-data-factory-demo/providers/microsoft.datafactory/factories/pipelinesetupv1\"\n                        ],\n                        [\n                            \"List Web Apps Functions Host Keys\",\n                            \"Microsoft.Web/sites/host/listkeys/action\",\n                            \"Informational\",\n                            \"Succeeded\",\n                            \"Succeeded\",\n                            \"OK (HTTP Status Code: 200)\",\n                            \"OK\",\n                            \"azure-data-factory-demo\",\n                            \"2f74b086-1adb-4bdf-ab0d-c693816302a7\",\n                            \"0fae4e36-1a5c-488d-b43d-a80d253904fa\",\n                            \"agamoni.demo@gmail.com\",\n                            \"103.217.243.70\",\n                            \"Administrative\",\n                            \"Administrative\",\n                            \"{\\r\\n  \\\"clientRequestId\\\": \\\"762f4182-473b-489d-b0a9-af27e77a802c\\\",\\r\\n  \\\"clientIpAddress\\\": \\\"103.217.243.70\\\",\\r\\n  \\\"method\\\": \\\"POST\\\"\\r\\n}\",\n                            \"{\\r\\n  \\\"statusCode\\\": \\\"OK\\\",\\r\\n  \\\"serviceRequestId\\\": \\\"bd5b0e2b-e3f5-44e7-b9a1-4ab5e65c18b1\\\",\\r\\n  \\\"eventCategory\\\": \\\"Administrative\\\",\\r\\n  \\\"entity\\\": \\\"/subscriptions/2f74b086-1adb-4bdf-ab0d-c693816302a7/resourceGroups/azure-data-factory-demo/providers/Microsoft.Web/sites/azurelogAnalyticsFunction/host/default\\\",\\r\\n  \\\"message\\\": \\\"Microsoft.Web/sites/host/listkeys/action\\\",\\r\\n  \\\"hierarchy\\\": \\\"\\\"\\r\\n}\",\n                            \"2020-11-09T15:25:05.171Z\",\n                            \"{\\r\\n  \\\"action\\\": \\\"Microsoft.Web/sites/host/listkeys/action\\\",\\r\\n  \\\"scope\\\": \\\"/subscriptions/2f74b086-1adb-4bdf-ab0d-c693816302a7/resourceGroups/azure-data-factory-demo/providers/Microsoft.Web/sites/azurelogAnalyticsFunction/host/default\\\"\\r\\n}\",\n                            \"/subscriptions/2f74b086-1adb-4bdf-ab0d-c693816302a7/resourceGroups/azure-data-factory-demo/providers/Microsoft.Web/sites/azurelogAnalyticsFunction/host/default\",\n                            \"556efabd-05d3-43fb-bc4d-a930179f3bfe\",\n                            \"Azure Web Sites\",\n                            \"Microsoft.Web\",\n                            \"default\",\n                            \"31e15213-24bb-4ff0-8364-43d57c0e1e57\",\n                            \"2f5d639a-25b6-44ac-8ee8-ec9f68fa95b5\",\n                            \"2020-11-09T15:23:00.198Z\",\n                            \"Azure\",\n                            null,\n                            \"\",\n                            null,\n                            null,\n                            \"\",\n                            \"AzureActivity\",\n                            \"/subscriptions/2f74b086-1adb-4bdf-ab0d-c693816302a7/resourcegroups/azure-data-factory-demo/providers/microsoft.web/sites/azureloganalyticsfunction/host/default\"\n                        ],\n                        [\n                            \"List Web Apps Functions Keys\",\n                            \"Microsoft.Web/sites/functions/listkeys/action\",\n                            \"Informational\",\n                            \"Succeeded\",\n                            \"Succeeded\",\n                            \"OK (HTTP Status Code: 200)\",\n                            \"OK\",\n                            \"azure-data-factory-demo\",\n                            \"2f74b086-1adb-4bdf-ab0d-c693816302a7\",\n                            \"0fae4e36-1a5c-488d-b43d-a80d253904fa\",\n                            \"agamoni.demo@gmail.com\",\n                            \"103.217.243.70\",\n                            \"Administrative\",\n                            \"Administrative\",\n                            \"{\\r\\n  \\\"clientRequestId\\\": \\\"762f4182-473b-489d-b0a9-af27e77a802c\\\",\\r\\n  \\\"clientIpAddress\\\": \\\"103.217.243.70\\\",\\r\\n  \\\"method\\\": \\\"POST\\\"\\r\\n}\",\n                            \"{\\r\\n  \\\"statusCode\\\": \\\"OK\\\",\\r\\n  \\\"serviceRequestId\\\": \\\"27419d58-b464-4b65-92cd-e71828d6db4c\\\",\\r\\n  \\\"eventCategory\\\": \\\"Administrative\\\",\\r\\n  \\\"entity\\\": \\\"/subscriptions/2f74b086-1adb-4bdf-ab0d-c693816302a7/resourceGroups/azure-data-factory-demo/providers/Microsoft.Web/sites/azurelogAnalyticsFunction/functions/convert-json-to-csv\\\",\\r\\n  \\\"message\\\": \\\"Microsoft.Web/sites/functions/listkeys/action\\\",\\r\\n  \\\"hierarchy\\\": \\\"\\\"\\r\\n}\",\n                            \"2020-11-09T15:23:20.163Z\",\n                            \"{\\r\\n  \\\"action\\\": \\\"Microsoft.Web/sites/functions/listkeys/action\\\",\\r\\n  \\\"scope\\\": \\\"/subscriptions/2f74b086-1adb-4bdf-ab0d-c693816302a7/resourceGroups/azure-data-factory-demo/providers/Microsoft.Web/sites/azurelogAnalyticsFunction/functions/convert-json-to-csv\\\"\\r\\n}\",\n                            \"/subscriptions/2f74b086-1adb-4bdf-ab0d-c693816302a7/resourceGroups/azure-data-factory-demo/providers/Microsoft.Web/sites/azurelogAnalyticsFunction/functions/convert-json-to-csv\",\n                            \"ae435877-1333-493d-bbaa-85ced05dea0b\",\n                            \"Azure Web Sites\",\n                            \"Microsoft.Web\",\n                            \"convert-json-to-csv\",\n                            \"7a04f31c-f57e-4251-84a3-208586fa2643\",\n                            \"2f5d639a-25b6-44ac-8ee8-ec9f68fa95b5\",\n                            \"2020-11-09T15:22:59.74Z\",\n                            \"Azure\",\n                            null,\n                            \"\",\n                            null,\n                            null,\n                            \"\",\n                            \"AzureActivity\",\n                            \"/subscriptions/2f74b086-1adb-4bdf-ab0d-c693816302a7/resourcegroups/azure-data-factory-demo/providers/microsoft.web/sites/azureloganalyticsfunction/functions/convert-json-to-csv\"\n                        ]\n                    ]\n                }\n            ]\n        },\n    \"logType\" : \"AzureActivity\",\n    \"containerName\" : \"@{pipeline().parameters.ContainerName}\",\n    \"folderName\" : \"@{pipeline().parameters.FolderName}\",\n    \"accountName\" : \"@{pipeline().parameters.AccountName}\",\n    \"accountKey\" : \"@{pipeline().parameters.AccountKey}\"\n}",
						"type": "Expression"
					}
				},
				"linkedServiceName": {
					"referenceName": "AzureFunction_CovertJsonToCsv_LinkedService",
					"type": "LinkedServiceReference"
				}
			}
		],
		"parameters": {
			"FunctionName": {
				"type": "string",
				"defaultValue": "accees-to-logAnalytics"
			},
			"TenentId": {
				"type": "string",
				"defaultValue": "dd4149a3-da2c-4ee2-bb69-b00528959f08"
			},
			"ContentType": {
				"type": "string",
				"defaultValue": "application/x-www-form-urlencoded"
			},
			"GrantType": {
				"type": "string",
				"defaultValue": "client_credentials"
			},
			"ClientId": {
				"type": "string",
				"defaultValue": "94d71110-76b3-4078-ad22-3ef3f7b654d1"
			},
			"ClientSecret": {
				"type": "string",
				"defaultValue": "ZU0~3AHZtSUMuvdEt2Um._0Xwxa_rB16_d"
			},
			"Resource": {
				"type": "string",
				"defaultValue": "https://api.loganalytics.io"
			},
			"EndPointUrl": {
				"type": "string",
				"defaultValue": "https://login.microsoftonline.com/"
			},
			"WorkSpaceId": {
				"type": "string",
				"defaultValue": "2f5d639a-25b6-44ac-8ee8-ec9f68fa95b5"
			},
			"LogAnalyticsUrl": {
				"type": "string",
				"defaultValue": "https://api.loganalytics.io/v1/workspaces/"
			},
			"LogQuery": {
				"type": "string",
				"defaultValue": "AzureActivity | where ActivityStatusValue == 'Succeeded' and TimeGenerated >= ago(2h);"
			},
			"PreProcessFunctionName": {
				"type": "string",
				"defaultValue": "convert-json-to-csv"
			},
			"ContainerName": {
				"type": "string",
				"defaultValue": "azureactivity"
			},
			"FolderName": {
				"type": "string",
				"defaultValue": "generallog"
			},
			"AccountName": {
				"type": "string",
				"defaultValue": "123datalakegen2"
			},
			"AccountKey": {
				"type": "string",
				"defaultValue": "+hmWpzgVZ7H/IJVu0Uc74O/tKgx8OSf1Cx/VU3yrzNWxGMKlYq7u92/J9pXUeh+xzskBw07FXB+A2Sx0tSFD6g=="
			}
		},
		"annotations": []
	}
}